openfoam/arc_M1.6_finwake/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
#include "../constant/freestreamProperties"
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $UInf;

boundaryField
{
    // Characteristic far-field: self-adapts to in/outflow, so the same BC
    // serves the upstream (inlet), downstream (outlet) and side (farfield)
    // outer patches. U/p/T give the freestream reference state.
    "(inlet|outlet|farfield)"
    {
        type            characteristicFarfieldVelocity;
        U               $UInf;
        p               $pInf;
        T               $TInf;
        value           $internalField;
    }
    fuselage
    {
        type            boundaryCorrectedFixedValue;
        value           uniform (0 0 0);
    }
    stabilizers
    {
        type            boundaryCorrectedFixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
